In [13]:
!pip install sqlalchemy==1.3.9

Requirement already satisfied: sqlalchemy==1.3.9 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (1.3.9)

In [14]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [15]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [16]:
!pip install -q pandas==1.1.5

In [17]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [19]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

/home/jupyterlab/conda/envs/python/lib/python3.7/site-packages/pandas/core/generic.py:2882: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  both result in 0.1234 being formatted as 0.12.

In [7]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
Done.

[]

In [31]:
#Display the names of the unique launch sites in the space mission
%sql SELECT * FROM SPACEXTBL limit 2;

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)')]

In [33]:
#Display the names of the unique launch sites in the space mission
%sql SELECT Distinct Launch_Site FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

In [34]:
#Display 5 records where launch sites begin with the string 'CCA'
%sql SELECT * FROM SPACEXTBL WHERE Launch_Site like '%CCA%' LIMIT (5);

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

In [46]:
#Display the total payload mass carried by boosters launched by NASA (CRS)
%sql SELECT sum(PAYLOAD_MASS__KG_) FROM SPACEXTBL WHERE Customer like '%NASA (CRS)%';

 * sqlite:///my_data1.db
Done.

[(48213,)]

In [48]:
#Display average payload mass carried by booster version F9 v1.1
%sql SELECT avg(PAYLOAD_MASS__KG_) FROM SPACEXTBL WHERE Booster_Version like '%F9 v1.1%';

 * sqlite:///my_data1.db
Done.

[(2534.6666666666665,)]

In [94]:
#List the date when the first succesful landing outcome in ground pad was acheived.
%sql SELECT Min(Date) FROM SPACEXTBL WHERE Landing_Outcome like '%ground pad%'and Mission_Outcome like '%Success%';

 * sqlite:///my_data1.db
Done.

[('2015-12-22',)]

In [83]:
#List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000
%sql SELECT Distinct Booster_Version FROM SPACEXTBL WHERE Landing_Outcome like '%Success (drone ship)%' and PAYLOAD_MASS__KG_ between 4000 and 6000;

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

In [105]:
#List the total number of successful mission outcomes
%sql SELECT count(Mission_Outcome) FROM SPACEXTBL WHERE Mission_Outcome like '%Success%';

 * sqlite:///my_data1.db
Done.

[(100,)]

In [106]:
#List the total number of failure mission outcomes
%sql SELECT count(Mission_Outcome) FROM SPACEXTBL WHERE Mission_Outcome like '%Failure%';

 * sqlite:///my_data1.db
Done.

[(1,)]

In [132]:
#List the names of the booster_versions which have carried the maximum payload mass. Use a subquery
%sql SELECT Distinct Booster_Version, Max(PAYLOAD_MASS__KG_) FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4', 15600)]

In [134]:
#List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.
%sql select Booster_Version, Launch_Site, Landing_Outcome From SPACEXTBL Where Landing_Outcome LIKE 'Failure(drone ship)' AND Date BETWEEN '2015-01-01' AND '2015-12-31'

 * sqlite:///my_data1.db
Done.

[]

In [136]:
#Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.
%sql Select Landing_Outcome, COUNT(Landing_Outcome) From SPACEXTBL WHERE DATE BETWEEN '2010-06-04' AND '2017-03-20'GROUP BY Landing_Outcome  ORDER BY COUNT (Landing_Outcome) DESC

 * sqlite:///my_data1.db
Done.

[('No attempt', 10),
 ('Success (drone ship)', 5),
 ('Failure (drone ship)', 5),
 ('Success (ground pad)', 3),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Failure (parachute)', 2),
 ('Precluded (drone ship)', 1)]